#include <iostream>
// !g++ -std=c++20 % -o %< && ./%<
// int x = 5;
// int y = x <<1;
// y = 10(сдвиг на 1 бит влево (x * 2) )
// int z = x >> 1;
// z = 2(там странная логика, но смысл в том что, было двоич. число 101(5) и мы
// потом сдвинули его на 1 бит вправо. Как бы срезали, а потом переделали в
// десят.с.и )
//
//
// ПОБИТОВЫЕ ОПЕРАЦИИ
// int x = 5 & 3;
// x = 1; (она порязрядно сравнивает их двоич.значения, те 101 и 011, у них "как
// бы" общие это первая единичка, все ост нули 001 = просто 1)
//
// int y = 5 | 3;
// y = 7; (хотя бы один 1 101 | 011 = 111)
//
// int z = 5^3;
// z = 6;(когда знаки противоположные 101^011 = 110)
//
// int a = ~5;
// a = -6; (~0101 = 1010)

int main() {
  int x = 1234, y = 2345, z = 3456;
  std::cout << "x + y = " << x + y << "\n";
  std::cout << "x - y = " << x - y << "\n";
  std::cout << "x * y = " << x * y << "\n";
  std::cout << "x / y = " << 1.0 * x / y << "\n";

  std::cout << "x % y = " << x % y << "\n";
  std::cout << "(((145 - 100 / 20) / 20) * 50) + 45 = "
            << (((145 - 100 / 20) / 20) * 50) + 45 << "\n";
  std::cout << "x % y = " << x % y << "\n";

  int a = 3, b = 7;
  int r1 = a & b, r2 = a | b, r3 = a ^ b;
  std::cout << "a & b = " << r1 << "\n";
  std::cout << "a | b = " << r2 << "\n";
  std::cout << "a ^ b = " << r3 << "\n";

  r1 = x << 1, r2 = x >> 1, r3 = ~x;
  std::cout << "x<<1 = " << r1 << "\n";
  std::cout << "x>>1 = " << r2 << "\n";
  std::cout << "~x = " << r3 << "\n";

  int bool1 = true, bool2 = false;
  int res_bool = bool1 && (bool1 && (bool1 && bool1 || bool2) &&
                           (bool2 || bool1 != bool2));
  std::cout << "true && (true && (true && true || false) && (false || true != "
               "false)) = "
            << res_bool << "\n";
  res_bool = 25 < 48 && (23 > (3 + 15) || (2 < 8 && (5 >= 2 && 15 < 15)));
  std::cout << "25 < 48 && (23 > (3 + 15) || (2 < 8 && (5 >= 2 && 15 < 15))) = "
            << res_bool << "\n";

  return 0;
}
